In [1]:
import pymysql
conn = pymysql.connect(
    host='localhost', 
    user='root', 
    passwd='123456', 
    db='mydb',
    port=3306, 
    charset='utf8')
cursor = conn.cursor()
creat = '''
CREATE TABLE ch4ex9 (
    id int,
    name char(8),
    grade int
)ENGINE INNODB DEFAULT CHARSET=utf8;'''
cursor.execute(creat)
conn.commit()

In [2]:
cursor.execute("insert into ch4ex9 (id,name,grade) values(%s,%s,%s)",(1,'luchy',87))
cursor.execute("insert into ch4ex9 (id,name,grade) values(%s,%s,%s)",(2,'peter',92))
cursor.execute("insert into ch4ex9 (id,name,grade) values(%s,%s,%s)",(3,'lili',85))
conn.commit()
cursor.close()
conn.close()

In [3]:
from pandas import DataFrame
import pymysql
conn = pymysql.connect(
    host='localhost', 
    user='root', 
    passwd='123456', 
    db='mydb',
    port=3306, 
    charset='utf8')
cursor = conn.cursor()
rows = cursor.execute('select * from ch4ex9')
rows

3

In [4]:
data = cursor.fetchall()
data

((1, 'luchy', 87), (2, 'peter', 92), (3, 'lili', 85))

In [5]:
from pandas import DataFrame
import pandas as pd
df = DataFrame(list(data))
df

   0      1   2
0  1  luchy  87
1  2  peter  92
2  3   lili  85

In [31]:
data

((1, 'luchy', 87), (2, 'peter', 92), (3, 'lili', 85))

In [32]:
type(data)

tuple

In [34]:
import pandas as pd
import pymysql
conn = pymysql.connect(
    host='localhost', 
    user='root', 
    passwd='123456', 
    db='mydb',
    port=3306, 
    charset='utf8')
df = pd.read_sql('select * from ch4ex9',conn)
df

   id   name  grade
0   1  luchy     87
1   2  peter     92
2   3   lili     85

In [35]:
df.to_sql?

In [37]:
df.to_sql(name='out6',con='mysql+pymysql://root:123456@localhost:3306/mydb?charset=utf8',if_exists='replace',index=False)

F:\Anaconda\envs\data-analysis\lib\site-packages\pymysql\cursors.py:166: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 480")
  result = self._query(query)